export const FAQ: { question: string; answer: string }[] = [
  {
    question:
      "Для чего необходимо вовлечение жителей в процесс разработки мастер-плана?",
    answer:
      "Создание мастер-плана Уссурийского городского округа — комплексный процесс, который требует максимального вовлечения всех заинтересованных сторон, среди которых — местные жители, представители бизнеса, органов власти и экспертного сообщества. Именно такой подход позволяет учесть интересы самого широкого круга людей, повышает качество проработанности пространственно-аналитических решений, от которых зависит создание комфортной городской среды в ближайшем будущем. Благодаря вовлечению местных жителей возможно формирование чувства глубокой сопричастности к значительным изменениям на территории проживания. Создание подобной платформы, на который Вы сейчас находитесь, необходимо для привлечения самого широкого круга лиц, и является одним из действенных инструментов по вовлечению местных жителей в разработку современных урбанистических решений.",
  },
  {
    question:
      "Как будут использованы идеи, собранные с помощью платформы «Чего хочет Уссурийск»?",
    answer:
      "Собранные идеи будут проанализированы сотрудниками администрации Уссурийского ГО и специалистами Факультета городского и регионального развития НИУ ВШЭ. На основе идей, предложенных на платформе «Чего хочет Уссурийск», будет подготовлен отчет, который будет размещен на этом портале и на сайте администрации Уссурийского ГО. Предложенные идеи и сформированный отчет лягут в основу принятия решений в рамках разработки мастер-плана городского округа Уссурийск и при принятии дальнейших урбанистических решений.",
  },
  {
    question: "Будут опубликованы все идеи?",
    answer:
      "Предложения идей проходят модерацию и только после первичного анализа будут опубликованы на карте и в каталоге идей.",
  },
];
