import { useEffect } from "react";
import { CollapsibleBlock, Container } from "../../components";
import styles from "./main-page.module.scss";

export const About = () => {
  useEffect(() => {
    const hash = window.location.hash;
    if (hash) {
      const element = document.querySelector(hash);
      if (element) {
        const rect = element.getBoundingClientRect();
        const offset = 100;
        window.scrollTo({
          top: rect.top + window.scrollY - offset,
          behavior: "smooth",
        });
      }
    }
  }, [window.location.hash]);

  return (
    <div className={styles.block} id="about">
      <h2 className={styles.blockTitle}>О Проекте</h2>
      <p className={styles.blockText}></p>
      <CollapsibleBlock header="Что такое мастер-план?">
        <p>
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
          Мастер-План- Мастер-План- Мастер-План- Мастер-План- Мастер-План-
        </p>
      </CollapsibleBlock>
    </div>
  );
};
