export const FAQ: { question: string; answer: string }[] = [
  {
    question:
      "Для чего необходимо вовлечение жителей в процесс разработки мастер-плана?",
    answer:
      "Создание мастер-плана Уссурийского городского округа — комплексный процесс, который требует максимального вовлечения всех заинтересованных сторон, среди которых — местные жители, представители бизнеса, органов власти и экспертного сообщества. Именно такой подход позволяет учесть интересы самого широкого круга людей, повышает качество проработанности пространственно-аналитических решений, от которых зависит создание комфортной городской среды в ближайшем будущем. Благодаря вовлечению местных жителей возможно формирование чувства глубокой сопричастности к значительным изменениям на территории проживания. Создание подобной платформы, на который Вы сейчас находитесь, необходимо для привлечения самого широкого круга лиц, и является одним из действенных инструментов по вовлечению местных жителей в разработку современных урбанистических решений.",
  },
  {
    question:
      "Как будут использованы идеи, собранные с помощью платформы «Чего хочет Уссурийск»?",
    answer:
      "Собранные идеи будут проанализированы сотрудниками администрации Уссурийского ГО и специалистами Факультета городского и регионального развития НИУ ВШЭ. На основе идей, предложенных на платформе «Чего хочет Уссурийск», будет подготовлен отчет, который будет размещен на этом портале и на сайте администрации Уссурийского ГО. Предложенные идеи и сформированный отчет лягут в основу принятия решений в рамках разработки мастер-плана городского округа Уссурийск и при принятии дальнейших урбанистических решений.",
  },
  {
    question: "Будут опубликованы все идеи?",
    answer:
      "Предложения идей проходят модерацию и только после первичного анализа будут опубликованы на карте и в каталоге идей.",
  },
];

export const STAGES = [
  {
    title: "Комплексный анализ города",
    dateRange: "Август - Сентябрь",
    description:
      "Проводим пространственный, градостроительный, социально-экономический анализ города, а также социокультурное исследование через интервью, онлайн-опрос и работу с историей Тары.",
  },
  {
    title:
      "Формируем видение с горожанами – задание на разработку мастер-плана",
    dateRange: "Сентябрь",
    description:
      "Собираем идеи горожан на интерактивной карте. Проводим серию проектных сессий и конференцию, на которых обсуждаем ценности и будущее Тары, договариваемся о целях, задачах, принципах и приоритетных направлениях развития города. Публикуем результаты социокультурного исследования и проектных сессий.",
  },
  {
    title: "Разработка предварительного мастер-плана",
    dateRange: "Октябрь - Ноябрь",
    description:
      "Разрабатываем концептуальную часть мастер-плана и предлагаем приоритетные направления развития города.",
  },
  {
    title: "Обсуждаем и оцениваем с горожанами концептуальный мастер-план",
    dateRange: "Ноябрь",
    description:
      "Публикуем концептуальный мастер-план с основными направлениями развития. Собираем обратную связь от горожан на сайте проекта и публичных мероприятиях, оцениваем направления развития мастер-плана с точки зрения соответствия тем ценностям, целям, задачам и принципам, которые сформировали на этапе задания. Результат этапа – список рекомендаций и уточнений для доработки мастер-плана.",
  },
  {
    title: "Доработка мастер-плана",
    dateRange: "Декабрь - Февраль",
    description:
      "Исправляем и вносим изменения по итогам обсуждений и оценки горожан, детально прорабатываем приоритетные направления развития.",
  },
  {
    title: "Презентация итогового мастер-плана",
    dateRange: "Март",
    description:
      "Публикуем мастер-план и проводим публичную презентацию, на которой подробно объясняем какие запросы горожан были учтены, а какие учесть не удалось (если такие будут) и по каким причинам.",
  },
];
